{"name":"Robert Balatbat","email":"robjb822@gmail.com","phone":"(323) 925-5050","profiles":"https://github.com/robjgbhttps://www.linkedin.com/in/robert-balatbat/https://github.com/robjgb/Ghibli-PalDecember 2021https://github.com/robjgb/SimpleTweetOctober 2021","education":"Bachelor of Science in Computer Science\nCalifornia State Polytechnic University, PomonaAugust 2019 - Present (Expected Spring2023)\nGPA: 3.92","experience":"Headstarter\nSoftware Engineering FellowSummer 2022\nLed 4+ fellows in the development of projects from design to deployment using MVC design patterns.\nBuilt serverless APIs utlizing AWS Lambda with 99 % uptime and realtime Dynamo DB data entry tables.\nMentored by Amazon, Bloomberg, and Capital One engineers on Agile, CI/CD, Git, and microservice patterns.\nCodePath.org\nAndroid Developer FellowFall 2021\nStudied android mobile development working in Android Studio and Java developing various applications.\nWorked in a group of four under an agile framework to implement an app idea that utilized the Marvel RESTful API for users\nto discover new comics and save them using a Parse database backend.","projects":"GhibliPal Flutter Application (Multi platform) \"https://github.com/robjgb/Ghibli-PalDecember 2021\nPublished a movie info app that displays all Studio Ghibli movies with pertinent information about them using a REST API.\nWritten in Dart using Flutter focusing on scalable UI and implements local CRUD functionalities using SQLite.\nSimpleTweet Android Application\"https://github.com/robjgb/SimpleTweetOctober 2021\nPublished a mock Android Twitter client application that allows a user to view their Twitter home timeline and compose\ntweets.\nWritten in Java using Android Studio and utilizes the Twitter REST API and other open-source libraries.\nLight and Sound Memory Game Website \"https://memory-game-robjgb.glitch.meApril 2021\nConstructed a simple, fun game similar to the popular Simon Says game, where the buttons play at random and the player\nmust repeat the pattern in order to win for multiple consecutive rounds.\nUtilized HTML, CSS, and Javascript, with a focus on UI and frontend design.","skills":"Programming Languages: Java, Python, HTML, CSS, JavaScript, Dart\nTools and Technologies: Github, Git, Android Studio, Flutter, Linux, VirtualBox, VMware (Kali and Ubuntu)\nACTIVITIES & ORGANIZATIONS\nCPP Virtual Reality Lab \"https://www.cppvr.org\nDeveloperSpring 2022\nProduced a virtual reality game called Snowdown, which consists of tower defense-inspired gameplay, specifically working\non the AI aspect designing units to play with or against with the help of pathfinding and agent-based modeling.\nCollaborated with three other members to develop the game using Unity to produce a minimum viable virtual reality\nproduct that has multiplatform VR support: Oculus Quest 2, HTC Vive, WebXR, etc.","awards":"President's Listfrom Spring 2020 - Present: GPA of3.5 or higher for two consecutive semesters."}